; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	infrared1 - mode
	thermograph2 - mode
	image3 - mode
	Star1 - direction
	Star4 - direction
	Star3 - direction
	GroundStation2 - direction
	Star0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 image3)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument3 image3)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared1)
	(supports instrument5 image3)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(pointing satellite2 Phenomenon7)
	(have_image Phenomenon5 thermograph2)
	(have_image Star6 spectrograph0)
	(have_image Phenomenon7 spectrograph0)
	(have_image Planet8 image3)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon10 spectrograph0)
	(have_image Phenomenon11 image3)
	(have_image Phenomenon12 thermograph2)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 9
2. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 9
3. (turn_to satellite2 phenomenon12 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon12)
   goals met: 0 of 9
4. (take_image satellite2 phenomenon12 instrument5 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 1 of 9
5. (turn_to satellite2 phenomenon11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 9
6. (turn_to satellite1 star0 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star0)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon11 instrument5 image3)
   added: (have_image phenomenon11 image3)
   goals met: 2 of 9
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 9
9. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 2 of 9
10. (turn_to satellite1 phenomenon10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 9
11. (take_image satellite1 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 9
12. (turn_to satellite1 phenomenon7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 9
13. (take_image satellite1 phenomenon7 instrument1 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 4 of 9
14. (turn_to satellite1 planet8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet8)
   goals met: 4 of 9
15. (take_image satellite1 planet8 instrument1 image3)
   added: (have_image planet8 image3)
   goals met: 5 of 9
16. (turn_to satellite1 star6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star6)
   goals met: 5 of 9
17. (take_image satellite1 star6 instrument1 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 6 of 9
18. (turn_to satellite2 phenomenon5 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon5)
   goals met: 6 of 9
19. (take_image satellite2 phenomenon5 instrument5 thermograph2)
   added: (have_image phenomenon5 thermograph2)
   goals met: 7 of 9
20. (turn_to satellite2 phenomenon9 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon9)
   goals met: 7 of 9
21. (take_image satellite2 phenomenon9 instrument5 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 8 of 9
22. (turn_to satellite2 phenomenon7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon7)
   goals met: 9 of 9
